; domain
(define (domain logistic_planning_2)
  (:requirements :strips :typing :conditional-effects)

  (:types
    location - object ; can contain workstations robots and boxes
    warehouse - location ; contains supplies
    workstation - object ; can get boxes and contain supplies
    robot - object ; can pick up boxes, fill them, unload them and move between locations
    carrier - location ; contains boxes if it has free spaces
    space - object ; determines how many spaces a carrier has
    box - object ; can contain supplies
    supply - object ; required by workstations
    valve - supply ; type of supply
    bolt - supply ; type of supply
    tool - supply ; type of supply
    )

  (:predicates
    ;; locations
    (connected ?l1 ?l2 - location) ; location ?l1 is connected to location ?l2
    ;; boxes
    (box_at_loc ?b - box ?l - location) ; box ?b is in the location ?l
    (box_empty ?b - box) ; box ?b is empty
    (box_full ?b - box) ; box ?b is full
    (supply_in_box ?s - supply ?b - box) ; supply ?s is in box ?b
    ;; robots
    (robot_at_loc ?r - robot ?l - location) ; robot ?r is at location ?l
    (robot_has_carrier ?r - robot ?c - carrier) ; robot ?r has carrier ?c
    ;; workstations
    (ws_at_loc ?w - workstation ?l - location) ; workstation ?w is at location ?l
    ;; (ws_contains ?w - workstation ?s - supply) ; workstation ?w contains supply ?s
    (has_valve ?w - workstation) ; workstation ?w has a valve
    (has_bolt ?w - workstation) ; workstation ?w has a bolt
    (has_tool ?w - workstation) ; workstation ?w has a tool 
    (supply_available ?s - supply) ; supply ?s is available
    ;; supplies
    (supply_at_loc ?s - supply ?l - location) ; supply ?s is at location ?l
    ;; carrier space
    (free ?c - carrier ?s - space) ; space ?s is not used carrier ?c
    (occupied ?c - carrier ?s - space) ; space ?s is used by carrier ?c
  )

  ;; moves a robot with its carrier to a new location
  (:action move_carrier
    :parameters (?r - robot ?c - carrier ?from ?to - location)
    :precondition (and
      (connected ?from ?to)
      (robot_at_loc ?r ?from)
      (robot_has_carrier ?r ?c)
    )
    :effect (and
      (not (robot_at_loc ?r ?from))
      (robot_at_loc ?r ?to)
    )
  )

  ;; loads the carrier of a robot with a box
  (:action load_carrier
    :parameters (?r - robot ?c - carrier ?b - box ?s - space ?l - location)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?l)
      (robot_has_carrier ?r ?c)
      (free ?c ?s)
    )
    :effect (and
      (not (box_at_loc ?b ?l))
      (box_at_loc ?b ?c)
      (not (free ?c ?s))
      (occupied ?c ?s)
    )
  )

  ;; unloads the carrier of a robot with a box
  (:action unload_carrier
    :parameters (?r - robot ?c - carrier ?b - box ?s - space ?l - location)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?c)
      (robot_has_carrier ?r ?c)
      (occupied ?c ?s)
    )
    :effect (and
      (box_at_loc ?b ?l)
      (not (box_at_loc ?b ?c))
      (free ?c ?s)
      (not (occupied ?c ?s))
    )
  )

  ;; loads an empty box with a supply
  (:action load_supply
    :parameters (?r - robot ?l - location ?b - box ?s - supply)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?l)
      (supply_at_loc ?s ?l)
      (box_empty ?b)
      (supply_available ?s)
    )
    :effect (and
      (supply_in_box ?s ?b)
      (not (box_empty ?b))
      (box_full ?b)
      (not (supply_at_loc ?s ?l))
    )
  )
  ;; unloads the content of a box to a given workstation (:action unload_supply
  (:action unload_valve
    :parameters (?r - robot ?b - box ?valve - valve ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?valve ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_valve ?s)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?valve ?l)
      ;; (ws_contains ?w ?valve)
      (not (supply_in_box ?valve ?b))
      (not (supply_available ?valve))
      (has_valve ?w)
    )
  )

  (:action unload_bolt
    :parameters (?r - robot ?b - box ?bolt - bolt ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?bolt ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_bolt ?bolt)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?bolt ?l)
      ;; (ws_contains ?w ?bolt)
      (not (supply_in_box ?bolt ?b))
      (not (supply_available ?bolt))
      (has_bolt ?w)
    )
  )
  (:action unload_tool
    :parameters (?r - robot ?b - box ?tool - tool ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?tool ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ; (is_tool ?tool)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?tool ?l)
      ;; (ws_contains ?w ?tool)
      (not (supply_in_box ?tool ?b))
      (not (supply_available ?tool))
      (has_tool ?w)
    )
  )
  ; ;; unloads the content of a box to a given workstation
  ; (:action unload_supply
  ;   :parameters (?r - robot ?b - box ?s - supply ?l - location ?w - workstation)
  ;   :precondition (and 
  ;     (robot_at_loc ?r ?l) 
  ;     (supply_in_box ?s ?b) 
  ;     (box_at_loc ?b ?l) 
  ;     (ws_at_loc ?w ?l) 
  ;     (box_full ?b)
  ;   )
  ;   :effect (and 
  ;     (box_empty ?b) 
  ;     (not (box_full ?b))
  ;     (supply_at_loc ?s ?l) 
  ;     (ws_contains_supply ?w ?s) 
  ;     (not (supply_in_box ?s ?b)) 
  ;     (not (supply_available ?s))
  ;     (when
  ;       (is_valve ?s)
  ;       (has_valve ?w))
  ;     (when
  ;       (is_bolt ?s)
  ;       (has_bolt ?w))
  ;     (when
  ;       (is_tool ?s)
  ;       (has_tool ?w))
  ;   )
  ; )
)

; problem
(define (problem problem2_2)
  (:domain logistic_planning_2)

  (:objects
    cargo drone - robot
    warehouse_loc location1 location2 location3 - location
    workstation1 workstation2 workstation3 workstation4 - workstation
    box1 box2 box3 - box
    valve1 valve2 valve3 - valve
    bolt1 bolt2 bolt3 - bolt
    tool1 tool2 tool3 - tool
    carrier1 carrier2 - carrier
    s1 s2 s3 s4 - space
  )

  (:init
    ;; graph edges
    (connected warehouse_loc location1)
    (connected warehouse_loc location2)
    (connected warehouse_loc location3)
    (connected location1 warehouse_loc)
    (connected location1 location2)
    (connected location1 location3)
    (connected location2 warehouse_loc)
    (connected location2 location1)
    (connected location3 warehouse_loc)
    (connected location3 location1)
    ;; workstations location
    (ws_at_loc workstation1 location1)
    (ws_at_loc workstation2 location1)
    (ws_at_loc workstation3 location2)
    (ws_at_loc workstation4 location3)
    ;; box location
    (box_at_loc box1 warehouse_loc)
    (box_at_loc box2 warehouse_loc)
    (box_at_loc box3 warehouse_loc)
    ;; box empty
    (box_empty box1)
    (box_empty box2)
    (box_empty box3)
    ;; robot location
    (robot_at_loc cargo drone)
    (robot_at_loc drone warehouse_loc)
    ;; carrier owner
    (robot_has_carrier cargo drone)
    (robot_has_carrier drone carrier2)
    ;; carrier space
    (free carrier1 s1)
    (free carrier1 s2)
    (free carrier1 s3)
    (free carrier2 s4)
    ;; supplies location
    (supply_at_loc valve1 warehouse_loc)
    (supply_at_loc valve2 warehouse_loc)
    (supply_at_loc valve3 warehouse_loc)
    (supply_at_loc bolt1 warehouse_loc)
    (supply_at_loc bolt2 warehouse_loc)
    (supply_at_loc bolt3 warehouse_loc)
    (supply_at_loc tool1 warehouse_loc)
    (supply_at_loc tool2 warehouse_loc)
    (supply_at_loc tool3 warehouse_loc)
    ;; supplies availabity
    (supply_available valve1)
    (supply_available valve2)
    (supply_available valve3)
    (supply_available bolt1)
    (supply_available bolt2)
    (supply_available bolt3)
    (supply_available tool1)
    (supply_available tool2)
    (supply_available tool3)
  )

  (:goal
    (and
      (robot_at_loc cargo drone)
      (robot_at_loc drone warehouse_loc)
      (has_valve workstation1)
      (has_valve workstation3)
      (has_valve workstation4)
      (has_bolt workstation2)
      (has_bolt workstation3)
      (has_bolt workstation4)
      (has_tool workstation2)
      (has_tool workstation3)
      (has_tool workstation4)
    )
  )
)

; plan
1. (load_supply drone warehouse_loc box1 bolt1)
   deleted: (box_empty box1) (supply_at_loc bolt1 warehouse_loc)
   added: (supply_in_box bolt1 box1) (box_full box1)
   goals met: 2 of 11
2. (load_carrier drone carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 2 of 11
3. (load_supply drone warehouse_loc box2 bolt2)
   deleted: (box_empty box2) (supply_at_loc bolt2 warehouse_loc)
   added: (supply_in_box bolt2 box2) (box_full box2)
   goals met: 2 of 11
4. (load_supply drone warehouse_loc box3 bolt3)
   deleted: (box_empty box3) (supply_at_loc bolt3 warehouse_loc)
   added: (supply_in_box bolt3 box3) (box_full box3)
   goals met: 2 of 11
5. (move_carrier drone carrier2 warehouse_loc location2)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location2)
   goals met: 1 of 11
6. (unload_carrier drone carrier2 box1 s4 location2)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 location2) (free carrier2 s4)
   goals met: 1 of 11
7. (unload_bolt drone box1 bolt1 location2 workstation3)
   deleted: (box_full box1) (supply_in_box bolt1 box1) (supply_available bolt1)
   added: (box_empty box1) (supply_at_loc bolt1 location2) (has_bolt workstation3)
   goals met: 2 of 11
8. (move_carrier drone carrier2 location2 location1)
   deleted: (robot_at_loc drone location2)
   added: (robot_at_loc drone location1)
   goals met: 2 of 11
9. (move_carrier drone carrier2 location1 location3)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone location3)
   goals met: 2 of 11
10. (move_carrier drone carrier2 location3 warehouse_loc)
   deleted: (robot_at_loc drone location3)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 3 of 11
11. (load_carrier drone carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 3 of 11
12. (move_carrier drone carrier2 warehouse_loc location3)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location3)
   goals met: 2 of 11
13. (unload_carrier drone carrier2 box2 s4 location3)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location3) (free carrier2 s4)
   goals met: 2 of 11
14. (unload_bolt drone box2 bolt2 location3 workstation4)
   deleted: (box_full box2) (supply_in_box bolt2 box2) (supply_available bolt2)
   added: (box_empty box2) (supply_at_loc bolt2 location3) (has_bolt workstation4)
   goals met: 3 of 11
15. (load_carrier drone carrier2 box2 s4 location3)
   deleted: (box_at_loc box2 location3) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 3 of 11
16. (move_carrier drone carrier2 location3 location1)
   deleted: (robot_at_loc drone location3)
   added: (robot_at_loc drone location1)
   goals met: 3 of 11
17. (unload_carrier drone carrier2 box2 s4 location1)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location1) (free carrier2 s4)
   goals met: 3 of 11
18. (move_carrier drone carrier2 location1 warehouse_loc)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 4 of 11
19. (load_carrier drone carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 4 of 11
20. (move_carrier drone carrier2 warehouse_loc location1)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location1)
   goals met: 3 of 11
21. (unload_carrier drone carrier2 box3 s4 location1)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 location1) (free carrier2 s4)
   goals met: 3 of 11
22. (load_carrier drone carrier2 box2 s4 location1)
   deleted: (box_at_loc box2 location1) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 3 of 11
23. (unload_bolt drone box3 bolt3 location1 workstation2)
   deleted: (box_full box3) (supply_in_box bolt3 box3) (supply_available bolt3)
   added: (box_empty box3) (supply_at_loc bolt3 location1) (has_bolt workstation2)
   goals met: 4 of 11
24. (move_carrier drone carrier2 location1 warehouse_loc)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 5 of 11
25. (unload_carrier drone carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 5 of 11
26. (load_supply drone warehouse_loc box2 valve1)
   deleted: (box_empty box2) (supply_at_loc valve1 warehouse_loc)
   added: (supply_in_box valve1 box2) (box_full box2)
   goals met: 5 of 11
27. (load_carrier drone carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 5 of 11
28. (move_carrier drone carrier2 warehouse_loc location3)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location3)
   goals met: 4 of 11
29. (unload_carrier drone carrier2 box2 s4 location3)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location3) (free carrier2 s4)
   goals met: 4 of 11
30. (unload_valve drone box2 valve1 location3 workstation4)
   deleted: (box_full box2) (supply_in_box valve1 box2) (supply_available valve1)
   added: (box_empty box2) (supply_at_loc valve1 location3) (has_valve workstation4)
   goals met: 5 of 11
31. (load_carrier drone carrier2 box2 s4 location3)
   deleted: (box_at_loc box2 location3) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 5 of 11
32. (move_carrier drone carrier2 location3 warehouse_loc)
   deleted: (robot_at_loc drone location3)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 6 of 11
33. (unload_carrier drone carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 6 of 11
34. (load_supply drone warehouse_loc box2 tool1)
   deleted: (box_empty box2) (supply_at_loc tool1 warehouse_loc)
   added: (supply_in_box tool1 box2) (box_full box2)
   goals met: 6 of 11
35. (load_carrier drone carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 6 of 11
36. (move_carrier drone carrier2 warehouse_loc location3)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location3)
   goals met: 5 of 11
37. (unload_carrier drone carrier2 box2 s4 location3)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location3) (free carrier2 s4)
   goals met: 5 of 11
38. (unload_tool drone box2 tool1 location3 workstation4)
   deleted: (box_full box2) (supply_in_box tool1 box2) (supply_available tool1)
   added: (box_empty box2) (supply_at_loc tool1 location3) (has_tool workstation4)
   goals met: 6 of 11
39. (move_carrier drone carrier2 location3 location1)
   deleted: (robot_at_loc drone location3)
   added: (robot_at_loc drone location1)
   goals met: 6 of 11
40. (load_carrier drone carrier2 box3 s4 location1)
   deleted: (box_at_loc box3 location1) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 6 of 11
41. (move_carrier drone carrier2 location1 warehouse_loc)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 7 of 11
42. (unload_carrier drone carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   goals met: 7 of 11
43. (load_supply drone warehouse_loc box3 tool2)
   deleted: (box_empty box3) (supply_at_loc tool2 warehouse_loc)
   added: (supply_in_box tool2 box3) (box_full box3)
   goals met: 7 of 11
44. (load_carrier drone carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 7 of 11
45. (move_carrier drone carrier2 warehouse_loc location1)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location1)
   goals met: 6 of 11
46. (unload_carrier drone carrier2 box3 s4 location1)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 location1) (free carrier2 s4)
   goals met: 6 of 11
47. (unload_tool drone box3 tool2 location1 workstation2)
   deleted: (box_full box3) (supply_in_box tool2 box3) (supply_available tool2)
   added: (box_empty box3) (supply_at_loc tool2 location1) (has_tool workstation2)
   goals met: 7 of 11
48. (load_carrier drone carrier2 box3 s4 location1)
   deleted: (box_at_loc box3 location1) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 7 of 11
49. (move_carrier drone carrier2 location1 warehouse_loc)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 8 of 11
50. (unload_carrier drone carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   goals met: 8 of 11
51. (load_supply drone warehouse_loc box3 valve2)
   deleted: (box_empty box3) (supply_at_loc valve2 warehouse_loc)
   added: (supply_in_box valve2 box3) (box_full box3)
   goals met: 8 of 11
52. (load_carrier drone carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 8 of 11
53. (move_carrier drone carrier2 warehouse_loc location1)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location1)
   goals met: 7 of 11
54. (unload_carrier drone carrier2 box3 s4 location1)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 location1) (free carrier2 s4)
   goals met: 7 of 11
55. (unload_valve drone box3 valve2 location1 workstation1)
   deleted: (box_full box3) (supply_in_box valve2 box3) (supply_available valve2)
   added: (box_empty box3) (supply_at_loc valve2 location1) (has_valve workstation1)
   goals met: 8 of 11
56. (move_carrier drone carrier2 location1 location2)
   deleted: (robot_at_loc drone location1)
   added: (robot_at_loc drone location2)
   goals met: 8 of 11
57. (load_carrier drone carrier2 box1 s4 location2)
   deleted: (box_at_loc box1 location2) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 8 of 11
58. (move_carrier drone carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc drone location2)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 9 of 11
59. (unload_carrier drone carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   goals met: 9 of 11
60. (load_supply drone warehouse_loc box1 tool3)
   deleted: (box_empty box1) (supply_at_loc tool3 warehouse_loc)
   added: (supply_in_box tool3 box1) (box_full box1)
   goals met: 9 of 11
61. (load_carrier drone carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 9 of 11
62. (move_carrier drone carrier2 warehouse_loc location2)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location2)
   goals met: 8 of 11
63. (unload_carrier drone carrier2 box1 s4 location2)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 location2) (free carrier2 s4)
   goals met: 8 of 11
64. (unload_tool drone box1 tool3 location2 workstation3)
   deleted: (box_full box1) (supply_in_box tool3 box1) (supply_available tool3)
   added: (box_empty box1) (supply_at_loc tool3 location2) (has_tool workstation3)
   goals met: 9 of 11
65. (load_carrier drone carrier2 box1 s4 location2)
   deleted: (box_at_loc box1 location2) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 9 of 11
66. (move_carrier drone carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc drone location2)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 10 of 11
67. (unload_carrier drone carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   goals met: 10 of 11
68. (load_supply drone warehouse_loc box1 valve3)
   deleted: (box_empty box1) (supply_at_loc valve3 warehouse_loc)
   added: (supply_in_box valve3 box1) (box_full box1)
   goals met: 10 of 11
69. (load_carrier drone carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 10 of 11
70. (move_carrier drone carrier2 warehouse_loc location2)
   deleted: (robot_at_loc drone warehouse_loc)
   added: (robot_at_loc drone location2)
   goals met: 9 of 11
71. (unload_carrier drone carrier2 box1 s4 location2)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 location2) (free carrier2 s4)
   goals met: 9 of 11
72. (unload_valve drone box1 valve3 location2 workstation3)
   deleted: (box_full box1) (supply_in_box valve3 box1) (supply_available valve3)
   added: (box_empty box1) (supply_at_loc valve3 location2) (has_valve workstation3)
   goals met: 10 of 11
73. (move_carrier drone carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc drone location2)
   added: (robot_at_loc drone warehouse_loc)
   goals met: 11 of 11
